# St7GetFaceFill

Returns the fill colour scheme for faces.

long St7GetFaceFill(long uID, long* Fill)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Fill

One of ffProperty, ffGroup, ffFaceNumber, ffFaceID, ffColour or ffOrientation.